{"entries": [{"name": "Christopher Hammerly", "project": "One piece of a larger project I am working on is to build a morphologically-parsed corpus of text in Ojibwe (Anishinaabemowin). We are using a Finite State Transducer (FST) to parse the text. The first part of our project was to build the FST, which is now more or less complete (we are in the stage of writing up results). We are now moving on to the next stage, which is to build the corpus itself. I am looking for students who would be willing to work on various aspects of corpus building. This includes (i) validating large amounts of OCR'd text and aiding in the automation of OCR error correction, (ii) processing scanned books and other texts to XML or other formats suitable for the corpus, (iii) working with other team members who are experts in Ojibwe language to validate annotations within the corpus, (iv) integrating the corpus into a web-based interface.", "email": "chris.hammerly@ubc.ca", "skills": "Any and all of the skills for the tasks above!", "members": "I think teams are great. If there are multiple students who are interested, I don't see a clear limit if they want to work together. Excited to work with as many of the students who want to help!"}, {"name": "Jian Zhu", "project": "Please find the project description via this link: https://docs.google.com/document/d/1TI-SJUpbATifBlLBDjSu-VCUPOGVIJ7iVhhThdVsb2M/edit?usp=sharing.\nYou can apply through the Google Form in the project description. ", "email": "jian.zhu@ubc.ca", "skills": "Strong background in CS/Math/Stats; Genuine interest in NLP research; Highly self-motivated. ", "members": "1-2 in T1 and 2-4 in T2. "}, {"name": "Molly Babel", "project": "In dealing with spontaneous speech, it is ideal to have utterances split by \"intonational phrases\". The heuristics used to parsing speech into intonational phrases are multifacted and rely on listeners. It is a very, very slow process. I would love if a MDS-CL student were interested in helping automate this process. We are currently in the midst of doing this manually for a corpus of Cantonese-English bilinguals and we'll need to do the same for Mandarin-English bilinguals.  This paper: https://journals.plos.org/plosone/article/authors?id=10.1371/journal.pone.0250969 gives an idea of the problem.", "email": "molly.babel@ubc.ca", "skills": "It would be nice if students interested in this project were bilingual themselves -- in any two languages, not just Cantonese-English or Mandarin-English. But, language-specific experience is also very much welcome, of course!", "members": "I think this is a typical speech project that may be perceived as easy, but might be more challenging than anticipated. It might make sense for two students to work on it together?"}]}
